tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
static uint8_t s_lcd_lvgl_bridged = 0;   // C LVGL display/indev bridge installed?

#if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
#define LCD_SPECTRUM_INPUT_BARS (27U)
#define LCD_SPECTRUM_COLUMNS    (256U)
#define LCD_SPECTRUM_MAX_H_PX   (50)
#define LCD_SPECTRUM_TICK_MS    (10U)
#define LCD_SPECTRUM_FRAME_MS   (100U)
#define LCD_WATERFALL_FRAME_MS  (33U)
#define LCD_SCOPE_FRAME_MS      (33U)
#define LCD_WATERFALL_PIXELS    (256U)
#define LCD_SCOPE_PIXELS        (128U)
#define LCD_NATIVE_GAP_PX       (4)
#define LCD_TUNE_CURSOR_PX      (9U)
#define LCD_SCOPE_FULL_SCALE    (2048)
#define LCD_WATERFALL_TOP_PAD   (18)
#define LCD_WATERFALL_SPEC_H    (30)
#define LCD_WATERFALL_GAP_PX    (2)
#define LCD_VIEW_SPECTRUM       (0U)
#define LCD_VIEW_WATERFALL      (1U)
#define LCD_VIEW_OFF            (2U)
#define LCD_SCOPE_VIEW_TIME     (0U)
#define LCD_SCOPE_VIEW_IQ       (1U)
#define LCD_SCOPE_VIEW_OFF      (2U)
#define LCD_CONST_POINTS        (64U)
static lv_obj_t *s_lcd_spectrum_obj;
/* Declarative SPEC redraw state: one stored height for every physical X column.
 * Direct framebuffer commits and foreign/full LVGL redraws consume the same state. */
static int16_t s_lcd_spectrum_h[LCD_SPECTRUM_COLUMNS];
static lv_timer_t *s_lcd_spectrum_timer;
static lv_color_t s_lcd_spectrum_bg;
static lv_color_t s_lcd_spectrum_bar;
static lv_color_t s_lcd_spectrum_center;
static uint8_t s_lcd_spectrum_valid;
static uint8_t s_lcd_spectrum_view;
static uint8_t s_lcd_spectrum_paused;
static uint8_t s_lcd_spectrum_pause_rebuild;
static uint8_t s_lcd_waterfall_reset;
static uint8_t s_lcd_left_clear_pending;
static uint32_t s_lcd_spectrum_last_fft_ms;
static uint32_t s_lcd_waterfall_rows;
/* The panorama and its axis belong to one confirmed physical-LO generation.
 * A requested retune remains pending until the first complete FFT carrying the
 * matching producer generation is actually drawn.  NCO motion is independent:
 * it changes only the marker offset and never reindexes retained pixel history. */
static int32_t s_lcd_spectrum_vfo_pending_hz;
static int32_t s_lcd_spectrum_vfo_committed_hz;
static uint32_t s_lcd_spectrum_generation_pending;
static uint32_t s_lcd_spectrum_generation_committed;
/* One compact, not-yet-visible FFT frame bridges the C producer and Python's
 * frequency labels.  The C timer stages it; Python arms the exact token, updates
 * the matching label state, then forces the one render that exposes both. */
static uint8_t s_lcd_spectrum_pending_level[LCD_SPECTRUM_COLUMNS];
static uint32_t s_lcd_spectrum_generation_ready;
static uint32_t s_lcd_spectrum_generation_armed;
static int32_t s_lcd_spectrum_pending_marker_px;
static int32_t s_lcd_spectrum_marker_px;
static uint8_t s_lcd_spectrum_vfo_pending;
static uint8_t s_lcd_spectrum_vfo_valid;
static uint32_t s_lcd_waterfall_last_us;
static uint32_t s_lcd_waterfall_max_us;
static uint32_t s_lcd_fft_last_us;
static uint32_t s_lcd_fft_max_us;
static int32_t s_lcd_const_peak;
static uint8_t s_lcd_scope_view;
static uint8_t s_lcd_right_clear_pending;
static uint32_t s_lcd_scope_source;
static uint32_t s_lcd_scope_tx_epoch;
static uint32_t s_lcd_scope_last_ms;
static uint32_t s_lcd_render_start_us;
static uint32_t s_lcd_render_last_us;
static uint32_t s_lcd_render_max_us;
static uint32_t s_lcd_render_start_frame;
static uint32_t s_lcd_render_crossed_frames;
static uint32_t s_lcd_render_count;
static uint32_t s_lcd_inv_since_render;
static uint8_t s_lcd_render_in_progress;
static uint32_t s_touch_deferred_polls;
static uint32_t s_lcd_render_inv_count;
static uint32_t s_lcd_render_max_inv_count;
static uint32_t s_lcd_render_full_inv_request_count;
static int32_t s_lcd_inv_y1 = 0x7fffffffL;
static int32_t s_lcd_inv_y2 = -1;
static int32_t s_lcd_render_y1 = -1;
static int32_t s_lcd_render_y2 = -1;
static uint32_t s_lcd_render_area_height;
static uint32_t s_lcd_render_previous_height;
static uint32_t s_lcd_render_previous_inv_count;
static uint32_t s_lcd_beam_estimate_us;
static uint32_t s_lcd_beam_delay_last_us;
static uint32_t s_lcd_beam_delay_max_us;
static uint32_t s_lcd_beam_delay_count;
static uint32_t s_lcd_beam_no_window_count;

#if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
static void lcd_spectrum_publish_render_ready(void);
#endif

static void lcd_render_dirty_bounds_reset(void) {
    s_lcd_inv_y1 = 0x7fffffffL;
    s_lcd_inv_y2 = -1;
}

static void lcd_spectrum_tuning_reset(void) {
    s_lcd_spectrum_vfo_pending_hz = 0;
    s_lcd_spectrum_vfo_committed_hz = 0;
    s_lcd_spectrum_generation_pending = 0U;
    s_lcd_spectrum_generation_committed = 0U;
    s_lcd_spectrum_generation_ready = 0U;
    s_lcd_spectrum_generation_armed = 0U;
    s_lcd_spectrum_pending_marker_px = 0;
    s_lcd_spectrum_marker_px = 0;
    s_lcd_spectrum_vfo_pending = 0U;
    s_lcd_spectrum_vfo_valid = 0U;
}

/* Hold the old pixels and axis while a physical retune is pending.  The producer
 * already rejects stale/mixed FFT halves; this second gate prevents a consumer
 * from committing any generation other than the one paired with the pending VFO. */
static bool lcd_spectrum_generation_prepare(uint32_t generation,
    bool *commit_pending) {
    *commit_pending = false;
    if (s_lcd_spectrum_vfo_pending) {
        if (generation != s_lcd_spectrum_generation_pending) {
            return false;
        }
        *commit_pending = true;
        return true;
    }
    if (!s_lcd_spectrum_vfo_valid ||
        (generation != s_lcd_spectrum_generation_committed)) {
        return false;
    }
    return true;
}

static void lcd_spectrum_generation_commit(uint32_t generation) {
    if (s_lcd_spectrum_vfo_pending &&
        (generation == s_lcd_spectrum_generation_pending)) {
        s_lcd_spectrum_vfo_committed_hz = s_lcd_spectrum_vfo_pending_hz;
        s_lcd_spectrum_generation_committed = generation;
        s_lcd_spectrum_vfo_valid = 1U;
        s_lcd_spectrum_vfo_pending = 0U;
        s_lcd_spectrum_generation_ready = 0U;
        s_lcd_spectrum_generation_armed = 0U;
    }
}

