tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
void lcd_Vsync_ISR(display_callback_args_t *p_args) {
    (void)p_args;
    lcd_vsync_counter++;
}

STATIC mp_int_t machine_lcd_set_buffer(mp_obj_t self_in, mp_buffer_info_t *bufinfo, mp_uint_t flags) {
    // mp_obj_framebuf_t *self = MP_OBJ_TO_PTR(self_in);
    bufinfo->buf = g_display0_cfg.input[0].p_base;
    bufinfo->len = g_display0_cfg.input[0].hstride * g_display0_cfg.input[0].vsize * ((g_display0_cfg.input[0].format < DISPLAY_IN_FORMAT_16BITS_RGB565)? 4 : 2);
    bufinfo->typecode = 'B'; // view framebuf as bytes
    return 0;
}

STATIC mp_obj_t machine_lcd_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 0, 0, false);

    // return self object
    return MP_OBJ_FROM_PTR(&machine_lcd_obj);
}

STATIC mp_obj_t lcd_init(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->isinited) {
        size_t framebuffer_size = g_display0_cfg.input[0].hstride *
            g_display0_cfg.input[0].vsize * sizeof(uint16_t);
        memset(g_display0_cfg.input[0].p_base, 0, framebuffer_size);

        if (FSP_SUCCESS == R_GLCDC_Open(&g_display0_ctrl, &g_display0_cfg)) {
            self->isinited = 1;
            ra_gpio_config(self->bl->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_LOW_POWER, 0);
            ra_gpio_config(self->en->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_LOW_POWER, 0);
            ra_gpio_write(self->bl->pin, 1);
            ra_gpio_write(self->en->pin, 1);
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't init R_GLCDC"));
        }

        ra_gpio_config(self->tch->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_LOW_POWER, 0);
        ra_gpio_write(self->tch->pin, 1);

        if (FSP_SUCCESS != R_SCI_I2C_Open(&g_i2c_touch_ctrl, &g_i2c_touch_cfg)) {
            machine_lcd_soft_reset();
            mp_raise_ValueError(MP_ERROR_TEXT("Can't init R_SCI"));
        }

        self->num_points = 0;
        s_touch_read_pending = 0;
        s_lcd_touch_active = 0;
        s_lcd_touch_x = 0;
        s_lcd_touch_y = 0;
        memset(&locked, 0, sizeof(locked));

        /* Enable touch IRQ only after the touch I2C instance is ready. */
        if (FSP_SUCCESS != R_ICU_ExternalIrqOpen(&g_external_irq11_ctrl, &g_external_irq11_cfg) ||
            FSP_SUCCESS != R_ICU_ExternalIrqEnable(&g_external_irq11_ctrl)) {
            machine_lcd_soft_reset();
            mp_raise_ValueError(MP_ERROR_TEXT("Can't init touch IRQ"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Olready inited!"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_init_obj, lcd_init);

STATIC mp_obj_t lcd_touched(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);

    /* Legacy Python input path: service the same IRQ-pending flag as the C bridge. */
    (void)touch_service_pending();

    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;

    if (!locked.num_stamp_points) {
        if (self->num_points) {
            locked.num_stamp_points = (self->num_points > FT5X06_NUM_POINTS)? FT5X06_NUM_POINTS : self->num_points;

            for (uint8_t i = 0; i < locked.num_stamp_points; i++) {
                locked.stamp_point[i] = self->point[i];
            }

            self->num_points = 0;
        } else {
            locked.num_stamp_points = 0;
        }
    }

    FSP_CRITICAL_SECTION_EXIT;

    return MP_OBJ_NEW_SMALL_INT(locked.num_stamp_points);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touched_obj, lcd_touched);

// touch_into(array('i'/'I', ...)): x, y, active, IRQ count, I2C errors.
// No tuple/wrapper creation, including the no-new-touch path. Caller owns storage.
STATIC mp_obj_t lcd_touch_into(mp_obj_t self_in, mp_obj_t buffer) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_buffer_info_t b;
    mp_get_buffer_raise(buffer, &b, MP_BUFFER_WRITE);
    if (b.len < 20 || ((uintptr_t)b.buf & 3) || (b.typecode != 'i' && b.typecode != 'I')) {
        mp_raise_ValueError(MP_ERROR_TEXT("touch_into needs aligned array('i'/'I') of 5 words"));
    }
    if (!self->isinited) return mp_const_false;
    bool updated = touch_service_pending();
    int32_t *out = b.buf;
    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;
    out[0] = s_lcd_touch_x;
    out[1] = s_lcd_touch_y;
    out[2] = s_lcd_touch_active;
    out[3] = (int32_t)s_touch_irq_count;
    out[4] = (int32_t)s_touch_i2c_errors;
    FSP_CRITICAL_SECTION_EXIT;
    return mp_obj_new_bool(updated);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_touch_into_obj, lcd_touch_into);

STATIC mp_obj_t lcd_touches(mp_obj_t self_in) {
    // machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);

    const char *ev[] = {"NONE", "DOWN", "HOLD", "MOVE", "UP"};

    if (!locked.num_stamp_points) {
        lcd_touched(self_in);
    }

    mp_obj_list_t *list = mp_obj_new_list(locked.num_stamp_points, NULL);

    if (locked.num_stamp_points) {
        // Add elements to the list
        for (uint8_t i = 0; i < locked.num_stamp_points; i++) {
            list->items[i] = mp_obj_new_tuple(3, (mp_obj_t[]) {mp_obj_new_int(locked.stamp_point[i].x), mp_obj_new_int(locked.stamp_point[i].y), mp_obj_new_str(ev[locked.stamp_point[i].event], strlen(ev[locked.stamp_point[i].event]))});
        }

        locked.num_stamp_points = 0;
    }
    return MP_OBJ_FROM_PTR(list);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touches_obj, lcd_touches);

#if defined(USE_FSP_DRW)
STATIC mp_obj_t lcd_drw_stats(mp_obj_t self_in) {
    (void)self_in;
    uint32_t irq_count;
    uint32_t allocation_count;
    uint32_t active_bytes;
    uint32_t peak_bytes;
    vk_ra6m3_dave2d_get_stats(&irq_count, &allocation_count, &active_bytes, &peak_bytes);
    mp_obj_t stats[] = {
        mp_obj_new_int_from_uint(irq_count),
        mp_obj_new_int_from_uint(allocation_count),
        mp_obj_new_int_from_uint(active_bytes),
        mp_obj_new_int_from_uint(peak_bytes),
    };
    return mp_obj_new_tuple(MP_ARRAY_SIZE(stats), stats);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_drw_stats_obj, lcd_drw_stats);
#endif

STATIC mp_obj_t lcd_deinit(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->isinited) {
        machine_lcd_soft_reset();
        if (self->isinited) {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't deinit LCD"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Not inited! call LCD.init() first"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_deinit_obj, lcd_deinit);

STATIC mp_obj_t lcd_start(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->isstarted) {
        if (FSP_SUCCESS == R_GLCDC_Start(&g_display0_ctrl)) {
            self->isstarted = 1;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't start R_GLCDC"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Olready started!"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_start_obj, lcd_start);

STATIC mp_obj_t lcd_stop(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->isstarted) {
        if (FSP_SUCCESS == R_GLCDC_Stop(&g_display0_ctrl)) {
            #if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
            s_lcd_scroll_blit.pending = 0U;
            #endif
            self->isstarted = 0;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't stop R_GLCDC"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Not started! call LCD.start() first"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_stop_obj, lcd_stop);

