tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
/*
STATIC mp_obj_t lcd_changebuf(mp_obj_t self_in, mp_obj_t idx){
	machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
	mp_int_t i = mp_obj_get_int(idx);

	self->ischanged = 0;
	if(self->isinited && self->isstarted)
		if(FSP_SUCCESS == R_GLCDC_BufferChange(&g_display0_ctrl, fb_background[i? 1 : 0], DISPLAY_FRAME_LAYER_1))
		{
			self->ischanged = 1;
			self->idx = i;
		}
	return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_changebuf_obj, lcd_changebuf);
*/
// vsync([timeout_ms=25]) -- block until the NEXT GLCDC line-detect (VSYNC)
// event or timeout. Returns True if the pulse arrived, False on timeout.
// Used to gate LVGL render start so DIRECT-mode drawing chases the scanout
// beam instead of racing it mid-frame (visible flicker on frequent updates).
STATIC mp_obj_t lcd_vsync(size_t n_args, const mp_obj_t *args) {
    (void)args;
    uint32_t timeout_ms = (n_args > 1) ? (uint32_t)mp_obj_get_int(args[1]) :
        LCD_VSYNC_TIMEOUT_MS;
    uint32_t start_cnt = lcd_vsync_counter;
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= timeout_ms) {
            s_lcd_vsync_timeouts++;
            return mp_const_false;
        }
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_vsync_obj, 1, 2, lcd_vsync);

/* ---- C LVGL display + input bridge -----------------------------------------------
 * Replaces the per-frame Python flush/touch/VSYNC callbacks in pRGB.py.  Those allocate
 * MicroPython wrapper objects on every render (flush) and every ~30 Hz input poll (read)
 * -- a continuous idle garbage stream that forces GC.  Registering the same three
 * callbacks in C removes that garbage entirely.  DIRECT single-framebuffer, identical
 * behaviour to the Python path (GLCDC framebuffer, cached FT5x06 touch, VSYNC gate). */
static void lcd_lv_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
    (void)area;
    (void)px_map;
    lv_display_flush_ready(disp);                    // DIRECT mode: drawing is done
}

static volatile uint32_t s_indev_calls = 0;          // diag: LVGL polls of the read cb
static volatile uint32_t s_indev_press = 0;          // diag: reads that saw a contact

static void lcd_lv_indev_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
    (void)indev;
    s_indev_calls++;
    /* Never deliver a new touch point while LVGL is rendering. Re-reporting the
     * cached point creates no new scroll delta; the newest FT5X06 sample stays
     * pending and is consumed after LV_EVENT_RENDER_READY. A merely pending dirty
     * area is not an active render and must not halve the input update rate. */
    if (s_lcd_render_in_progress == 0U) {
        (void)touch_service_pending();
    } else if (s_touch_read_pending != 0U) {
        s_touch_deferred_polls++;
    }

    uint8_t active;
    int16_t x;
    int16_t y;
    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;
    active = s_lcd_touch_active;
    x = s_lcd_touch_x;
    y = s_lcd_touch_y;
    FSP_CRITICAL_SECTION_EXIT;
    if (active) {
        s_indev_press++;
    }
    data->point.x = (int32_t)x;
    data->point.y = (int32_t)y;
    data->state = active ? LV_INDEV_STATE_PRESSED : LV_INDEV_STATE_RELEASED;
}

// touch_debug() -> (indev polls, pressed polls, x, y, active, IRQs, I2C errors,
//                   timeouts, deferred polls, render active, pending invalidations).
STATIC mp_obj_t lcd_touch_debug(mp_obj_t self_in) {
    (void)self_in;
    mp_obj_t t[11] = {
        mp_obj_new_int_from_uint(s_indev_calls),
        mp_obj_new_int_from_uint(s_indev_press),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_x),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_y),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_active),
        mp_obj_new_int_from_uint(s_touch_irq_count),
        mp_obj_new_int_from_uint(s_touch_i2c_errors),
        mp_obj_new_int_from_uint(s_touch_i2c_timeouts),
        mp_obj_new_int_from_uint(s_touch_deferred_polls),
        MP_OBJ_NEW_SMALL_INT(s_lcd_render_in_progress),
        mp_obj_new_int_from_uint(s_lcd_inv_since_render),
    };
    return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touch_debug_obj, lcd_touch_debug);

/* DIRECT mode uses the GLCDC framebuffer itself as LVGL's only draw buffer.  If
 * a top-of-screen update takes longer than the vertical blanking interval,
 * starting it at line detect lets GLCDC scan partially updated pixels.  Delay
 * only when the measured/predicted render fits behind the active scan line. */
static uint32_t lcd_lv_beam_delay_for_area(int32_t y1, int32_t y2,
    uint32_t inv_count) {
    uint32_t total_lines = g_display0_cfg.output.vtiming.total_cyc;
    uint32_t active_lines = g_display0_cfg.output.vtiming.display_cyc;
    if ((total_lines <= active_lines) || (y1 < 0) || (y2 < y1)) {
        s_lcd_beam_estimate_us = 0U;
        return 0U;
    }

    uint32_t area_height = (uint32_t)(y2 - y1 + 1);
    uint32_t estimate_us = LCD_BEAM_INITIAL_RENDER_US;
    bool similar_height = (s_lcd_render_previous_height != 0U) &&
        (area_height <= (s_lcd_render_previous_height * 2U)) &&
        (s_lcd_render_previous_height <= (area_height * 2U));
    bool similar_work = (s_lcd_render_previous_inv_count != 0U) &&
        (inv_count <= (s_lcd_render_previous_inv_count * 2U + 2U)) &&
        (s_lcd_render_previous_inv_count <= (inv_count * 2U + 2U));
    if (similar_height && similar_work && (s_lcd_render_last_us != 0U)) {
        estimate_us = s_lcd_render_last_us;
    }
    estimate_us += LCD_BEAM_RENDER_MARGIN_US;
    s_lcd_beam_estimate_us = estimate_us;

    uint32_t blank_lines = total_lines - active_lines;
    uint32_t immediate_lines = blank_lines + (uint32_t)y1;
    uint32_t immediate_us = (uint32_t)(((uint64_t)immediate_lines *
        LCD_GLCDC_FRAME_US) / total_lines);
    if (estimate_us <= immediate_us) {
        return 0U;
    }

    uint32_t dirty_scan_us = (uint32_t)(((uint64_t)area_height *
        LCD_GLCDC_FRAME_US) / total_lines);
    uint32_t delayed_window_us = LCD_GLCDC_FRAME_US - dirty_scan_us;
    if (estimate_us >= delayed_window_us) {
        s_lcd_beam_no_window_count++;
        /* Neither start is fully guaranteed, but an immediate top-band render has
         * only the vertical blank before GLCDC reaches it. For a shallow band,
         * starting just after the beam passed the dirty area is still the strictly
         * larger window and avoids the visible flash caused by returning 0 here. */
        if ((area_height > active_lines / 3U) ||
            (delayed_window_us <= immediate_us)) {
            return 0U;
        }
    }

    uint32_t delay_lines = blank_lines + (uint32_t)y2 + 1U;
    uint32_t delay_us = (uint32_t)(((uint64_t)delay_lines *
        LCD_GLCDC_FRAME_US) / total_lines) + LCD_BEAM_SCAN_GUARD_US;
    if (delay_us >= LCD_GLCDC_FRAME_US) {
        s_lcd_beam_no_window_count++;
        return 0U;
    }
    return delay_us;
}

static void lcd_lv_render_start_cb(lv_event_t *e) {
    (void)e;
    s_lcd_render_in_progress = 1U;
    int32_t render_y1 = s_lcd_inv_y1;
    int32_t render_y2 = s_lcd_inv_y2;
    uint32_t render_inv_count = s_lcd_inv_since_render;
    lcd_render_dirty_bounds_reset();
    s_lcd_inv_since_render = 0U;

    uint32_t start_cnt = lcd_vsync_counter;          // wait for the next GLCDC frame pulse
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    bool line_detect_seen = true;
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            line_detect_seen = false;
            break;
        }
    }

    s_lcd_render_y1 = -1;
    s_lcd_render_y2 = -1;
    s_lcd_render_area_height = 0U;
    s_lcd_beam_delay_last_us = 0U;
    if ((render_y1 >= 0) && (render_y2 >= render_y1)) {
        s_lcd_render_y1 = render_y1;
        s_lcd_render_y2 = render_y2;
        s_lcd_render_area_height = (uint32_t)(render_y2 - render_y1 + 1);
        if (line_detect_seen) {
            s_lcd_beam_delay_last_us = lcd_lv_beam_delay_for_area(
                render_y1, render_y2, render_inv_count);
            if (s_lcd_beam_delay_last_us != 0U) {
                mp_hal_delay_us(s_lcd_beam_delay_last_us);
                s_lcd_beam_delay_count++;
                if (s_lcd_beam_delay_last_us > s_lcd_beam_delay_max_us) {
                    s_lcd_beam_delay_max_us = s_lcd_beam_delay_last_us;
                }
            }
        } else {
            s_lcd_beam_estimate_us = 0U;
        }
    } else {
        s_lcd_beam_estimate_us = 0U;
    }

    s_lcd_render_start_frame = lcd_vsync_counter;
    s_lcd_render_start_us = (uint32_t)mp_hal_ticks_us();
    s_lcd_render_count++;
    s_lcd_render_inv_count = render_inv_count;
    if (s_lcd_render_inv_count > s_lcd_render_max_inv_count) {
        s_lcd_render_max_inv_count = s_lcd_render_inv_count;
    }

    /* Apply a staged scroll only inside the render transaction.  Doing this from
     * the Python touch callback can race GLCDC scanout and creates the very flash
     * this path is intended to remove.  Cortex-M4 has no data cache, so the DMB is
     * sufficient before LVGL paints the exposed strip into the same framebuffer. */
    if (s_lcd_scroll_blit.pending != 0U) {
        lcd_scroll_blit_t op = s_lcd_scroll_blit;
        uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
        uint32_t stride = g_display0_cfg.input[0].hstride;
        size_t row_bytes = (size_t)op.w * sizeof(uint16_t);

        if (op.dy > 0) {                 /* pixels move down: copy bottom -> top */
            for (int32_t row = op.h - op.dy; row-- > 0;) {
                memmove(fb + (uint32_t)(op.y + op.dy + row) * stride + (uint32_t)op.x,
                    fb + (uint32_t)(op.y + row) * stride + (uint32_t)op.x,
                    row_bytes);
            }
        } else {                         /* pixels move up: copy top -> bottom */
            int32_t up = -op.dy;
            for (int32_t row = 0; row < op.h - up; ++row) {
                memmove(fb + (uint32_t)(op.y + row) * stride + (uint32_t)op.x,
                    fb + (uint32_t)(op.y + up + row) * stride + (uint32_t)op.x,
                    row_bytes);
            }
        }
        __DMB();
        s_lcd_scroll_blit.pending = 0U;
    }
}

