tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
/* Raw invalidate-request diagnostics. This callback runs before LVGL duplicate
 * filtering and before a 32-area overflow is replaced with a full-screen area. */
static void lcd_lv_invalidate_area_cb(lv_event_t *e) {
    lv_area_t *area = lv_event_get_invalidated_area(e);
    s_lcd_inv_since_render++;
    if (area != NULL) {
        int32_t display_height = (int32_t)g_display0_cfg.input[0].vsize;
        if ((area->y2 >= 0) && (area->y1 < display_height)) {
            int32_t y1 = area->y1 < 0 ? 0 : area->y1;
            int32_t y2 = area->y2 >= display_height ? display_height - 1 : area->y2;
            if (y1 < s_lcd_inv_y1) {
                s_lcd_inv_y1 = y1;
            }
            if (y2 > s_lcd_inv_y2) {
                s_lcd_inv_y2 = y2;
            }
        }
    }
    if ((area != NULL) && (area->x1 <= 0) && (area->y1 <= 0) &&
        (area->x2 >= (int32_t)g_display0_cfg.input[0].hsize - 1) &&
        (area->y2 >= (int32_t)g_display0_cfg.input[0].vsize - 1)) {
        s_lcd_render_full_inv_request_count++;
    }
}

static void lcd_lv_render_ready_cb(lv_event_t *e) {
    (void)e;
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    lcd_spectrum_publish_render_ready();
    #endif
    s_lcd_render_in_progress = 0U;
    if (s_lcd_render_start_us == 0U) {
        return;
    }
    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - s_lcd_render_start_us;
    s_lcd_render_last_us = elapsed;
    if (elapsed > s_lcd_render_max_us) {
        s_lcd_render_max_us = elapsed;
    }
    if (lcd_vsync_counter != s_lcd_render_start_frame) {
        s_lcd_render_crossed_frames++;
    }
    s_lcd_render_previous_height = s_lcd_render_area_height;
    s_lcd_render_previous_inv_count = s_lcd_render_inv_count;
}

/* ---- C spectrum surface ----------------------------------------------------------
 * A high-rate graph must not be represented by independently laid-out Python
 * widgets.  This attaches one ordinary LVGL object, retains 256 physical-column
 * heights for declarative redraws, and normally commits them directly after VSYNC.
 * There is no Python draw callback, flex re-layout, transient canvas, or heap traffic. */
static void lcd_lv_spectrum_plot_area(const lv_area_t *obj_area,
    lv_area_t *plot_area) {
    *plot_area = *obj_area;
    plot_area->x1 = obj_area->x1;
    plot_area->x2 = plot_area->x1 + (int32_t)LCD_WATERFALL_PIXELS - 1;
    plot_area->y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
}

/* Fast approximate -60..0 dB mapping without 256 log10f calls per row.  IEEE-754
 * exponent + the top mantissa byte approximate log2(r); 10 octaves are 60.2 dB. */
static uint8_t lcd_waterfall_level(float ratio) {
    if (!(ratio > 0.0009765625f)) {       /* <= 2^-10 */
        return 0U;
    }
    if (ratio >= 1.0f) {
        return 255U;
    }
    union {
        float f;
        uint32_t u;
    } bits = { .f = ratio };
    int32_t exponent = (int32_t)((bits.u >> 23) & 0xFFU) - 127;
    int32_t log2_q8 = exponent * 256 + (int32_t)((bits.u >> 15) & 0xFFU);
    int32_t level = ((log2_q8 + 10 * 256) * 255) / (10 * 256);
    if (level < 0) {
        level = 0;
    } else if (level > 255) {
        level = 255;
    }
    return (uint8_t)level;
}

/* PicoRX-style six-section heat map, calculated directly into RGB565.  Keeping the
 * conversion arithmetic here avoids a second 256-entry image/palette buffer. */
static uint16_t lcd_waterfall_rgb565(uint8_t level) {
    uint32_t scaled = (uint32_t)level * 6U;
    uint8_t section = (uint8_t)(scaled >> 8);
    uint8_t t = (uint8_t)scaled;
    uint8_t r = 0U;
    uint8_t g = 0U;
    uint8_t b = 0U;
    switch (section) {
        case 0: b = t; break;                         /* black -> blue   */
        case 1: g = t; b = 255U; break;              /* blue -> cyan    */
        case 2: g = 255U; b = (uint8_t)(255U - t); break; /* cyan -> green */
        case 3: r = t; g = 255U; break;              /* green -> yellow */
        case 4: r = 255U; g = (uint8_t)(255U - t); break; /* yellow -> red */
        default: r = 255U; g = t; b = t; break;      /* red -> white    */
    }
    return lv_color_to_u16(lv_color_make(r, g, b));
}

/* Reduce the physical-LO FFT into one fixed screen column.  NCO tuning must never
 * enter this mapping: it moves only the independent listening marker. */
static bool lcd_panorama_column_level(const float *magnitudes, uint32_t fft_n,
    float inv, uint32_t x, uint8_t *level_out) {
    uint32_t lo = (x * fft_n) / LCD_SPECTRUM_COLUMNS;
    uint32_t hi = ((x + 1U) * fft_n) / LCD_SPECTRUM_COLUMNS;
    float peak = 0.0f;
    bool valid = false;
    for (uint32_t k = lo; k < hi; ++k) {
        uint32_t src = (k + (fft_n / 2U)) & (fft_n - 1U);
        if (magnitudes[src] > peak) {
            peak = magnitudes[src];
        }
        valid = true;
    }
    *level_out = valid ? lcd_waterfall_level(peak * inv) : 0U;
    return valid;
}

static bool lcd_panorama_levels_from_frame(const float *magnitudes,
    uint32_t fft_n, float ref_peak, uint8_t *levels) {
    if ((magnitudes == NULL) || !(ref_peak > 0.0f) ||
        (levels == NULL) || (fft_n < LCD_SPECTRUM_COLUMNS) ||
        ((fft_n & (fft_n - 1U)) != 0U)) {
        return false;
    }
    float inv = 1.0f / ref_peak;
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        uint8_t level;
        bool valid = lcd_panorama_column_level(magnitudes, fft_n, inv, x, &level);
        levels[x] = valid ? level : 0U;
    }
    return true;
}

static void lcd_spectrum_state_from_levels(const uint8_t *levels) {
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        s_lcd_spectrum_h[x] = (int16_t)(1 + ((int32_t)levels[x] *
            (LCD_SPECTRUM_MAX_H_PX - 1) + 127) / 255);
    }
    s_lcd_spectrum_valid = 1U;
}

static bool lcd_spectrum_state_from_frame(const float *magnitudes, uint32_t fft_n,
    float ref_peak) {
    uint8_t levels[LCD_SPECTRUM_COLUMNS];
    if (!lcd_panorama_levels_from_frame(magnitudes, fft_n, ref_peak, levels)) {
        return false;
    }
    lcd_spectrum_state_from_levels(levels);
    return true;
}

