tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
static int32_t lcd_spectrum_marker_from_bins(int32_t marker_bins,
    uint32_t fft_n) {
    if (fft_n == 0U) {
        return 0;
    }
    int64_t scaled = (int64_t)marker_bins * (int64_t)LCD_SPECTRUM_COLUMNS;
    scaled += (scaled >= 0) ? (int64_t)(fft_n / 2U) : -(int64_t)(fft_n / 2U);
    return (int32_t)(scaled / (int64_t)fft_n);
}

static int32_t lcd_tune_cursor_x(const lv_area_t *plot) {
    int32_t cursor_x = plot->x1 + (int32_t)(LCD_WATERFALL_PIXELS / 2U) +
        s_lcd_spectrum_marker_px;
    int32_t lo = plot->x1 + (int32_t)(LCD_TUNE_CURSOR_PX / 2U);
    int32_t hi = plot->x2 - (int32_t)(LCD_TUNE_CURSOR_PX / 2U);
    if (cursor_x < lo) {
        cursor_x = lo;
    } else if (cursor_x > hi) {
        cursor_x = hi;
    }
    return cursor_x;
}

/* Draw a high-contrast listening marker independently of signal energy.  The
 * full-height stem makes the selected frequency obvious on silence, while the
 * nine-pixel cap remains inside the plot's declaratively redrawn ownership. */
static void lcd_tune_cursor_draw_fb(uint16_t *fb, uint32_t stride,
    const lv_area_t *plot) {
    int32_t cursor_x = lcd_tune_cursor_x(plot);
    int32_t cursor_top = plot->y1;
    uint16_t black = lv_color_to_u16(lv_color_make(0U, 0U, 0U));
    uint16_t white = lv_color_to_u16(lv_color_make(255U, 255U, 255U));
    uint16_t core = lv_color_to_u16(s_lcd_spectrum_center);
    if (plot->y2 < (cursor_top + 2)) {
        return;
    }
    uint16_t *row0 = fb + (uint32_t)cursor_top * stride +
        (uint32_t)(cursor_x - (int32_t)(LCD_TUNE_CURSOR_PX / 2U));
    for (uint32_t x = 0U; x < LCD_TUNE_CURSOR_PX; ++x) {
        row0[x] = black;
    }
    uint16_t *row1 = fb + (uint32_t)(cursor_top + 1) * stride +
        (uint32_t)(cursor_x - (int32_t)(LCD_TUNE_CURSOR_PX / 2U) + 1);
    for (uint32_t x = 0U; x < (LCD_TUNE_CURSOR_PX - 2U); ++x) {
        row1[x] = white;
    }
    /* A three-pixel black/cyan/black stem stays legible on both the white SPEC
     * background and the multicolour WF heat map.  It runs to the top of the live
     * histogram but never enters LVGL's label band, so direct redraws erase it. */
    for (int32_t y = cursor_top + 2; y <= plot->y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride;
        row[(uint32_t)(cursor_x - 1)] = black;
        row[(uint32_t)cursor_x] = core;
        row[(uint32_t)(cursor_x + 1)] = black;
    }
}

/* The WF view is combined, not waterfall-only.  Both ordinary frames and the
 * staged physical-LO handoff use the same 256 fixed physical-frequency levels. */
static void lcd_waterfall_draw_levels(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, uint16_t *new_row, const uint8_t *levels) {
    lv_area_t plot = {
        .x1 = obj_area->x1,
        .y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD,
        .y2 = obj_area->y1 + LCD_WATERFALL_TOP_PAD + LCD_WATERFALL_SPEC_H - 1,
    };
    plot.x2 = plot.x1 + (int32_t)LCD_WATERFALL_PIXELS - 1;

    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    for (int32_t y = plot.y1; y <= plot.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)plot.x1;
        for (int32_t x = plot.x1; x <= plot.x2; ++x) {
            row[x - plot.x1] = bg;
        }
    }

    uint16_t bar_color = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t center_color = lv_color_to_u16(s_lcd_spectrum_center);
    int32_t marker_x = lcd_tune_cursor_x(&plot) - plot.x1;
    for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
        uint8_t level = levels[x];
        new_row[x] = lcd_waterfall_rgb565(level);
        int32_t height = 1 + ((int32_t)level *
            (LCD_WATERFALL_SPEC_H - 1) + 127) / 255;
        int32_t px = plot.x1 + (int32_t)x;
        uint16_t color = ((int32_t)x == marker_x) ?
            center_color : bar_color;
        for (int32_t y = plot.y2 - height + 1; y <= plot.y2; ++y) {
            fb[(uint32_t)y * stride + (uint32_t)px] = color;
        }
    }
    lcd_tune_cursor_draw_fb(fb, stride, &plot);
}

static bool lcd_scope_prepare(const int16_t *samples, size_t n,
    const lv_area_t *obj_area, int16_t *scope_y);
static void lcd_scope_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *scope_y);
static bool lcd_constellation_prepare(const int16_t *i_samples,
    const int16_t *q_samples, size_t n, const lv_area_t *obj_area,
    int16_t *point_x, int16_t *point_y);
static void lcd_constellation_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *point_x, const int16_t *point_y);

/* Every native writer bypasses LVGL and indexes the physical framebuffer directly.
 * Keep one shared geometry gate so spectrum_attach() cannot turn an off-screen but
 * otherwise valid LVGL object into an unsigned framebuffer OOB write. */
static bool lcd_native_geometry_valid(const lv_area_t *obj_area) {
    int32_t screen_w = (int32_t)g_display0_cfg.input[0].hsize;
    int32_t screen_h = (int32_t)g_display0_cfg.input[0].vsize;
    int32_t native_w = (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX +
        (int32_t)LCD_SCOPE_PIXELS;
    int64_t native_right = (int64_t)obj_area->x1 + native_w;
    int64_t native_top = (int64_t)obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int64_t split_y = native_top + LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    return (g_display0_cfg.input[0].p_base != NULL) &&
        (g_display0_cfg.input[0].hstride >= g_display0_cfg.input[0].hsize) &&
        (lv_area_get_width(obj_area) >= native_w) && (obj_area->x1 >= 0) &&
        (native_right <= screen_w) && (native_top >= 0) &&
        (split_y < obj_area->y2) && (obj_area->y2 < screen_h);
}

/* OFF owns only the native pixels below the 18 px LVGL label band.  Clear each
 * panel once from the timer, after the active-screen/pause gates, so setters never
 * write the framebuffer from an arbitrary Python/LVGL callback context. */
static void lcd_native_clear_pending(void) {
    if ((!s_lcd_left_clear_pending && !s_lcd_right_clear_pending) ||
        (s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }

