tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }

    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    int32_t y1 = obj_area.y1 + LCD_WATERFALL_TOP_PAD;
    for (int32_t y = y1; y <= obj_area.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)obj_area.x1;
        if (s_lcd_left_clear_pending) {
            for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
                row[x] = bg;
            }
        }
        if (s_lcd_right_clear_pending) {
            uint16_t *right = row + LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX;
            for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
                right[x] = bg;
            }
        }
    }
    s_lcd_left_clear_pending = 0U;
    s_lcd_right_clear_pending = 0U;
}

/* Direct single-framebuffer waterfall at the far-left 256 pixels.  The FFT is
 * peak-reduced to that width; the framebuffer itself is the history.  When a
 * fresh DAC scope frame is available its fixed screen coordinates are prepared
 * before the common VSYNC wait and drawn in the adjacent 128 pixels in the same
 * framebuffer transaction. */
static bool lcd_waterfall_write_levels(const uint8_t *levels,
    const int16_t *scope_samples, size_t scope_n,
    const int16_t *i_samples, const int16_t *q_samples, size_t iq_n) {
    if ((levels == NULL) ||
        (s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return false;
    }

    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    int32_t obj_w = lv_area_get_width(&obj_area);
    int32_t x1 = obj_area.x1;
    int32_t y1 = obj_area.y1 + LCD_WATERFALL_TOP_PAD + LCD_WATERFALL_SPEC_H +
        LCD_WATERFALL_GAP_PX;
    int32_t y2 = obj_area.y2;
    if ((obj_w <= 0) || !lcd_native_geometry_valid(&obj_area) || (y1 >= y2)) {
        return false;
    }

    int16_t scope_y[LCD_SCOPE_PIXELS];
    int16_t point_x[LCD_CONST_POINTS];
    int16_t point_y[LCD_CONST_POINTS];
    bool iq_view = s_lcd_scope_view == LCD_SCOPE_VIEW_IQ;
    bool right_valid = false;
    if (iq_view) {
        right_valid = lcd_constellation_prepare(i_samples, q_samples, iq_n,
            &obj_area, point_x, point_y);
    } else if (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) {
        right_valid = lcd_scope_prepare(scope_samples, scope_n, &obj_area, scope_y);
    }

    /* Start immediately after a fresh line-detect pulse.  The graph begins around
     * the middle of the panel, leaving several milliseconds for the bounded history
     * moves before GLCDC reaches the same scan lines. */
    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);

    if (s_lcd_waterfall_reset) {
        for (int32_t y = y1; y <= y2; ++y) {
            uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
            for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
                row[x] = bg;
            }
        }
        s_lcd_waterfall_reset = 0U;
        s_lcd_waterfall_rows = 0U;
    }

    for (int32_t y = y2; y > y1; --y) {
        uint16_t *dst = fb + (uint32_t)y * stride + (uint32_t)x1;
        const uint16_t *src = dst - stride;
        memcpy(dst, src, LCD_WATERFALL_PIXELS * sizeof(uint16_t));
    }

    uint16_t *new_row = fb + (uint32_t)y1 * stride + (uint32_t)x1;
    lcd_waterfall_draw_levels(fb, stride, &obj_area, new_row, levels);
    if (right_valid && iq_view) {
        lcd_constellation_draw(fb, stride, &obj_area, point_x, point_y);
    } else if (right_valid) {
        lcd_scope_draw(fb, stride, &obj_area, scope_y);
    }

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
    s_lcd_waterfall_rows++;
    return true;
}

static bool lcd_waterfall_write(const float *magnitudes, float ref_peak,
    const int16_t *scope_samples, size_t scope_n,
    const int16_t *i_samples, const int16_t *q_samples, size_t iq_n) {
    uint8_t levels[LCD_SPECTRUM_COLUMNS];
    uint32_t fft_n = (uint32_t)ra_iq_adc_spectrum_size();
    if (!lcd_panorama_levels_from_frame(magnitudes, fft_n, ref_peak, levels)) {
        return false;
    }
    return lcd_waterfall_write_levels(levels, scope_samples, scope_n,
        i_samples, q_samples, iq_n);
}

/* Convert the newest 512-sample DAC frame into the 128 final screen Y positions
 * before waiting for VSYNC.  This finishes long before the producer can wrap back
 * to the claimed ping-pong half, so no third capture buffer is needed. */
static bool lcd_scope_prepare_rate(const int16_t *samples, size_t n,
    const lv_area_t *obj_area, int16_t *scope_y, uint32_t rate_hz) {
    if ((samples == NULL) || (scope_y == NULL) ||
        (n < (2U * LCD_SCOPE_PIXELS))) {
        return false;
    }
    /* Fixed 1/24000 s per pixel in RX and TX. Resample the display positions,
     * never the TX audio. Frame and index bounds remain explicit. */
    size_t span = ((LCD_SCOPE_PIXELS - 1U) * rate_hz) / 24000U + 1U;
    if (!rate_hz || span >= n) {
        return false;
    }

