tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    int32_t y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int32_t y2 = obj_area->y2;
    if (y1 + 3 >= y2) {
        return false;
    }

    int32_t frame_peak = 0;
    for (size_t k = 0U; k < n; ++k) {
        int32_t v = samples[k];
        int32_t a = (v < 0) ? -v : v;
        if (a > frame_peak) {
            frame_peak = a;
        }
    }
    int32_t hysteresis = frame_peak / 16;
    if (hysteresis < 4) {
        hysteresis = 4;
    }
    size_t trigger = 0U;
    bool armed = false;
    size_t max_trigger = n - span;
    for (size_t k = 0U; k <= max_trigger; ++k) {
        int32_t v = samples[k];
        if (v <= -hysteresis) {
            armed = true;
        } else if (armed && (v >= hysteresis)) {
            trigger = k;
            break;
        }
    }

    /* Share the exact horizontal divider used by the left SPEC/WF panel.  The
     * native plot is not vertically symmetric (18 px label pad at the top), so
     * the geometric centre sits four pixels below that divider and makes the
     * adjacent traces look misaligned. */
    int32_t center_y = obj_area->y1 + LCD_WATERFALL_TOP_PAD +
        LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    int32_t upper_h = center_y - y1 - 1;
    int32_t lower_h = y2 - center_y - 1;
    int32_t half_h = (upper_h < lower_h) ? upper_h : lower_h;
    for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
        int32_t v = samples[trigger + (x * rate_hz) / 24000U];
        /* TIME is an oscilloscope, not a second hidden AGC.  DAC0 is exactly
         * 0..4095, captured here as -2048..2047, so a fixed 2048-count divisor
         * preserves real amplitude changes.  The receiver AGC, when enabled,
         * remains visible because it changes the actual samples themselves. */
        int32_t y = center_y - (v * half_h) / LCD_SCOPE_FULL_SCALE;
        if (y < y1) {
            y = y1;
        } else if (y > y2) {
            y = y2;
        }
        scope_y[x] = (int16_t)y;
    }
    return true;
}

static bool lcd_scope_prepare(const int16_t *samples, size_t n,
    const lv_area_t *obj_area, int16_t *scope_y) {
    return lcd_scope_prepare_rate(samples, n, obj_area, scope_y, 24000U);
}

static void lcd_scope_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *scope_y) {
    int32_t x1 = obj_area->x1 + (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX;
    int32_t y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int32_t y2 = obj_area->y2;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    uint16_t grid = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t trace = lv_color_to_u16(s_lcd_spectrum_center);

    for (int32_t y = y1; y <= y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
        for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
            row[x] = bg;
        }
    }
    int32_t center_y = obj_area->y1 + LCD_WATERFALL_TOP_PAD +
        LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    uint16_t *center_row = fb + (uint32_t)center_y * stride + (uint32_t)x1;
    for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
        center_row[x] = grid;
    }

    int32_t previous_y = scope_y[0];
    for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
        int32_t y = scope_y[x];
        int32_t lo = (y < previous_y) ? y : previous_y;
        int32_t hi = (y > previous_y) ? y : previous_y;
        int32_t px = x1 + (int32_t)x;
        for (int32_t py = lo; py <= hi; ++py) {
            fb[(uint32_t)py * stride + (uint32_t)px] = trace;
        }
        previous_y = y;
    }
}

/* Convert the newest 64 consecutive complex samples from the spectrum ping-pong into
 * a square I/Q plot.  Consecutive samples are intentional: regularly reducing 512->64
 * would strobe coherent test tones (for example 3 kHz at 24 ksps) onto one point. */
static bool lcd_constellation_prepare(const int16_t *i_samples,
    const int16_t *q_samples, size_t n, const lv_area_t *obj_area,
    int16_t *point_x, int16_t *point_y) {
    if ((i_samples == NULL) || (q_samples == NULL) ||
        (point_x == NULL) || (point_y == NULL) || (n < LCD_CONST_POINTS)) {
        return false;
    }

    size_t start = n - LCD_CONST_POINTS;
    int32_t frame_peak = 0;
    for (size_t k = start; k < n; ++k) {
        int32_t iv = i_samples[k];
        int32_t qv = q_samples[k];
        int32_t ai = (iv < 0) ? -iv : iv;
        int32_t aq = (qv < 0) ? -qv : qv;
        if (ai > frame_peak) {
            frame_peak = ai;
        }
        if (aq > frame_peak) {
            frame_peak = aq;
        }
    }
    if (frame_peak > s_lcd_const_peak) {
        s_lcd_const_peak = frame_peak;
    } else {
        s_lcd_const_peak -= (s_lcd_const_peak - frame_peak + 15) / 16;
    }
    if (s_lcd_const_peak < 32) {
        s_lcd_const_peak = 32;
    }

    int32_t x1 = obj_area->x1 + (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX;
    int32_t x2 = x1 + (int32_t)LCD_SCOPE_PIXELS - 1;
    int32_t y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int32_t y2 = obj_area->y2;
    int32_t center_x = (x1 + x2) / 2;
    int32_t center_y = obj_area->y1 + LCD_WATERFALL_TOP_PAD +
        LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    int32_t radius_x = (x2 - x1) / 2 - 2;
    int32_t radius_y1 = center_y - y1 - 2;
    int32_t radius_y2 = y2 - center_y - 2;
    int32_t radius = radius_x;
    if (radius_y1 < radius) {
        radius = radius_y1;
    }
    if (radius_y2 < radius) {
        radius = radius_y2;
    }
    if (radius < 2) {
        return false;
    }

    for (uint32_t p = 0U; p < LCD_CONST_POINTS; ++p) {
        size_t k = start + p;
        int32_t x = center_x + ((int32_t)i_samples[k] * radius) / s_lcd_const_peak;
        int32_t y = center_y - ((int32_t)q_samples[k] * radius) / s_lcd_const_peak;
        if (x < x1) { x = x1; } else if (x > x2) { x = x2; }
        if (y < y1) { y = y1; } else if (y > y2) { y = y2; }
        point_x[p] = (int16_t)x;
        point_y[p] = (int16_t)y;
    }
    return true;
}

static void lcd_constellation_line(uint16_t *fb, uint32_t stride,
    int32_t x0, int32_t y0, int32_t x1, int32_t y1, uint16_t color,
    int32_t clip_x1, int32_t clip_y1, int32_t clip_x2, int32_t clip_y2) {
    int32_t dx = (x1 >= x0) ? (x1 - x0) : (x0 - x1);
    int32_t sx = (x0 < x1) ? 1 : -1;
    int32_t dy_abs = (y1 >= y0) ? (y1 - y0) : (y0 - y1);
    int32_t dy = -dy_abs;
    int32_t sy = (y0 < y1) ? 1 : -1;
    int32_t err = dx + dy;
    for (;;) {
        if ((x0 >= clip_x1) && (x0 <= clip_x2) &&
            (y0 >= clip_y1) && (y0 <= clip_y2)) {
            fb[(uint32_t)y0 * stride + (uint32_t)x0] = color;
        }
        if ((x0 == x1) && (y0 == y1)) {
            break;
        }
        int32_t e2 = 2 * err;
        if (e2 >= dy) {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx) {
            err += dx;
            y0 += sy;
        }
    }
}

static void lcd_constellation_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *point_x, const int16_t *point_y) {
    int32_t x1 = obj_area->x1 + (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX;
    int32_t x2 = x1 + (int32_t)LCD_SCOPE_PIXELS - 1;
    int32_t y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int32_t y2 = obj_area->y2;
    int32_t center_x = (x1 + x2) / 2;
    int32_t center_y = obj_area->y1 + LCD_WATERFALL_TOP_PAD +
        LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    uint16_t grid = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t trace = lv_color_to_u16(s_lcd_spectrum_center);

    for (int32_t y = y1; y <= y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
        for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
            row[x] = bg;
        }
    }
    uint16_t *center_row = fb + (uint32_t)center_y * stride + (uint32_t)x1;
    for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
        center_row[x] = grid;
    }
    for (int32_t y = y1; y <= y2; ++y) {
        fb[(uint32_t)y * stride + (uint32_t)center_x] = grid;
    }

