tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    for (uint32_t p = 1U; p < LCD_CONST_POINTS; ++p) {
        lcd_constellation_line(fb, stride, point_x[p - 1U], point_y[p - 1U],
            point_x[p], point_y[p], trace, x1, y1, x2, y2);
    }
    /* Make each observation visible even when several coherent samples overlap. */
    for (uint32_t p = 0U; p < LCD_CONST_POINTS; ++p) {
        int32_t x = point_x[p];
        int32_t y = point_y[p];
        fb[(uint32_t)y * stride + (uint32_t)x] = trace;
        if (x < x2) {
            fb[(uint32_t)y * stride + (uint32_t)(x + 1)] = trace;
        }
        if (y < y2) {
            fb[(uint32_t)(y + 1) * stride + (uint32_t)x] = trace;
        }
    }
}

/* Draw one persistent magnitude height per physical SPEC column.  The current
 * declarative state is committed together with the right-hand scope after one
 * VSYNC, without periodic LVGL invalidations. */
static void lcd_spectrum_draw_direct(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area) {
    lv_area_t plot_area;
    lcd_lv_spectrum_plot_area(obj_area, &plot_area);
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    uint16_t bar = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t marker = lv_color_to_u16(s_lcd_spectrum_center);
    int32_t plot_h = lv_area_get_height(&plot_area);
    int32_t marker_x = lcd_tune_cursor_x(&plot_area);

    for (int32_t y = plot_area.y1; y <= plot_area.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)plot_area.x1;
        for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
            row[x] = bg;
        }
    }
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        int32_t height = s_lcd_spectrum_h[x];
        if (height <= 0) {
            continue;
        }
        if (height > plot_h) {
            height = plot_h;
        }
        int32_t px = plot_area.x1 + (int32_t)x;
        uint16_t column_color = (px == marker_x) ? marker : bar;
        for (int32_t y = plot_area.y2 - height + 1; y <= plot_area.y2; ++y) {
            fb[(uint32_t)y * stride + (uint32_t)px] = column_color;
        }
    }
    lcd_tune_cursor_draw_fb(fb, stride, &plot_area);
}

static void lcd_constellation_write(const int16_t *i_samples,
    const int16_t *q_samples, size_t n) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }
    int16_t point_x[LCD_CONST_POINTS];
    int16_t point_y[LCD_CONST_POINTS];
    if (!lcd_constellation_prepare(i_samples, q_samples, n, &obj_area,
        point_x, point_y)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    if (s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) {
        lcd_spectrum_draw_direct(fb, stride, &obj_area);
    }
    lcd_constellation_draw(fb, stride, &obj_area, point_x, point_y);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
}

/* Commit the current SPEC state without depending on either right-panel producer.
 * This is what keeps left SPEC live when TIME, IQ, or the entire right panel is
 * unavailable/OFF. */
static bool lcd_spectrum_write(void) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return false;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return false;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    lcd_spectrum_draw_direct((uint16_t *)g_display0_cfg.input[0].p_base,
        g_display0_cfg.input[0].hstride, &obj_area);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
    return true;
}

#if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
/* Reduce the first complete frame of a new physical-LO generation into a tiny
 * stable handoff buffer.  Nothing visible changes here: Python must explicitly
 * arm this exact token before updating the RF labels and forcing their render. */
static bool lcd_spectrum_stage_generation(const float *magnitudes,
    float ref_peak, int32_t marker_bins, uint32_t generation) {
    uint32_t fft_n = (uint32_t)ra_iq_adc_spectrum_size();
    if (!s_lcd_spectrum_vfo_pending || (generation == 0U) ||
        (generation != s_lcd_spectrum_generation_pending) ||
        !lcd_panorama_levels_from_frame(magnitudes, fft_n, ref_peak,
            s_lcd_spectrum_pending_level)) {
        return false;
    }
    s_lcd_spectrum_pending_marker_px = lcd_spectrum_marker_from_bins(marker_bins,
        fft_n);
    __DMB();
    s_lcd_spectrum_generation_ready = generation;
    return true;
}

/* Arm the exact staged frame after Python has updated the label object state.
 * A one-pixel header invalidation guarantees an LVGL transaction; its RENDER_READY
 * callback commits the graph after LVGL has painted the new labels but before the
 * transaction is considered complete. */
static bool lcd_spectrum_publish_generation(uint32_t generation) {
    if (!s_lcd_spectrum_vfo_pending || (generation == 0U) ||
        (generation != s_lcd_spectrum_generation_pending) ||
        (generation != s_lcd_spectrum_generation_ready)) {
        return false;
    }

    if ((s_lcd_spectrum_obj == NULL) ||
        !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return false;
    }
    if (s_lcd_spectrum_view != LCD_VIEW_OFF) {
        lv_area_t obj_area;
        lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
        if (!lcd_native_geometry_valid(&obj_area)) {
            return false;
        }
    }

