tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    s_lcd_spectrum_generation_armed = generation;
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    lv_area_t kick = {
        .x1 = obj_area.x1,
        .x2 = obj_area.x1,
        .y1 = obj_area.y1,
        .y2 = obj_area.y1,
    };
    lv_obj_invalidate_area(s_lcd_spectrum_obj, &kick);
    return true;
}

/* Cancel only an explicitly armed, not-yet-rendered generation.  Staged levels and
 * the pending VFO token remain intact so Python can retry after a recoverable UI
 * exception; visible spectrum/waterfall state has not changed yet. */
static bool lcd_spectrum_abort_generation(uint32_t generation) {
    if ((generation == 0U) ||
        (s_lcd_spectrum_generation_armed != generation)) {
        return false;
    }
    s_lcd_spectrum_generation_armed = 0U;
    return true;
}

/* No VSYNC wait here: LV_EVENT_RENDER_READY is already inside the transaction
 * whose start was gated behind the scan beam.  SPEC is reconstructed from its
 * declarative height state; WF intentionally starts a new history with this first
 * matching row. */
static void lcd_spectrum_publish_render_ready(void) {
    uint32_t generation = s_lcd_spectrum_generation_armed;
    if ((generation == 0U) || !s_lcd_spectrum_vfo_pending ||
        (generation != s_lcd_spectrum_generation_pending) ||
        (generation != s_lcd_spectrum_generation_ready) ||
        s_lcd_spectrum_paused ||
        (s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj) ||
        (lv_obj_get_screen(s_lcd_spectrum_obj) != lv_screen_active())) {
        return;
    }

    if (s_lcd_spectrum_view == LCD_VIEW_OFF) {
        s_lcd_spectrum_marker_px = s_lcd_spectrum_pending_marker_px;
        s_lcd_spectrum_valid = 0U;
        s_lcd_waterfall_reset = 1U;
        s_lcd_spectrum_generation_armed = 0U;
        lcd_spectrum_generation_commit(generation);
        lcd_native_capture_apply(true);
        return;
    }

    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    uint32_t stride = g_display0_cfg.input[0].hstride;
    /* Install staged state only inside the render transaction that will expose it.
     * Until this point spectrum_publish(-token) can abort without any visible-state
     * rollback, even if Python failed while updating the matching labels. */
    s_lcd_spectrum_marker_px = s_lcd_spectrum_pending_marker_px;
    s_lcd_spectrum_valid = 0U;
    s_lcd_waterfall_reset = 1U;
    if (s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) {
        lcd_spectrum_state_from_levels(s_lcd_spectrum_pending_level);
        lcd_spectrum_draw_direct(fb, stride, &obj_area);
    } else if (s_lcd_spectrum_view == LCD_VIEW_WATERFALL) {
        int32_t x1 = obj_area.x1;
        int32_t y1 = obj_area.y1 + LCD_WATERFALL_TOP_PAD +
            LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
        int32_t y2 = obj_area.y2;
        uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
        for (int32_t y = y1; y <= y2; ++y) {
            uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
            for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
                row[x] = bg;
            }
        }
        s_lcd_waterfall_reset = 0U;
        s_lcd_waterfall_rows = 0U;
        uint16_t *new_row = fb + (uint32_t)y1 * stride + (uint32_t)x1;
        lcd_waterfall_draw_levels(fb, stride, &obj_area, new_row,
            s_lcd_spectrum_pending_level);
        s_lcd_waterfall_rows = 1U;
    } else {
        return;
    }

    __DMB();
    s_lcd_spectrum_generation_armed = 0U;
    lcd_spectrum_generation_commit(generation);
    lcd_native_capture_apply(true);
}
#endif

/* Scope framebuffer transaction.  SPEC redraws its left panel in the same VSYNC
 * transaction.  A WF tick can reach this helper when the DAC frame is ready but
 * the FFT frame is not; in that case the left framebuffer is the waterfall
 * history and must not be touched. */
static void lcd_scope_write_rate(const int16_t *samples, size_t n, uint32_t rate_hz) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }
    int16_t scope_y[LCD_SCOPE_PIXELS];
    if (!lcd_scope_prepare_rate(samples, n, &obj_area, scope_y, rate_hz)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    if (!ra_tx_hw_owns_resources() && s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) {
        lcd_spectrum_draw_direct(fb, stride, &obj_area);
    }
    lcd_scope_draw(fb, stride, &obj_area, scope_y);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
}

static void lcd_scope_write(const int16_t *samples, size_t n) {
    lcd_scope_write_rate(samples, n, 24000U);
}

#if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
/* Stage a physical-LO generation barrier even while the left panel is OFF.  The
 * matching complete FFT is still the proof that the new RF region exists; Python
 * publishes its labels and explicitly ACKs this stable frame without drawing. */
static void lcd_spectrum_complete_hidden_generation(uint32_t now) {
    if (!s_lcd_spectrum_vfo_pending ||
        ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) < LCD_SPECTRUM_FRAME_MS)) {
        return;
    }
    if ((s_lcd_spectrum_last_fft_ms == 0U) ||
        ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
         (3U * LCD_SPECTRUM_FRAME_MS))) {
        s_lcd_spectrum_last_fft_ms = now;
    } else {
        s_lcd_spectrum_last_fft_ms += LCD_SPECTRUM_FRAME_MS;
    }

    const float *magnitudes;
    float ref_peak;
    int32_t marker_bins;
    uint32_t generation;
    uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
    bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &marker_bins,
        &generation, NULL, NULL, NULL);
    uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
    bool commit_generation = false;
    if (!ready || !lcd_spectrum_generation_prepare(generation,
        &commit_generation) || !commit_generation) {
        return;
    }

    s_lcd_fft_last_us = fft_elapsed;
    if (fft_elapsed > s_lcd_fft_max_us) {
        s_lcd_fft_max_us = fft_elapsed;
    }
    (void)lcd_spectrum_stage_generation(magnitudes, ref_peak, marker_bins,
        generation);
}
#endif

/* The two native panels are independent consumers.  SPEC consumes one raw FFT
 * frame at 10 Hz; TIME/IQ run at 30 Hz.  WF combines ready left/right data in one
 * transaction, while either OFF state consumes no frame for that panel. */
static void lcd_lv_spectrum_timer_cb(lv_timer_t *timer) {
    (void)timer;
    if (s_lcd_spectrum_obj == NULL) {
        return;
    }
    if (!lv_obj_is_valid(s_lcd_spectrum_obj)) {
        s_lcd_spectrum_obj = NULL;
        lcd_native_capture_apply(false);
        return;
    }
    /* Direct framebuffer pixels are legal only on the HOME receiver screen and
     * while no same-screen modal overlay is open.  lv_obj_is_visible() alone is
     * insufficient: objects on an inactive LVGL screen still have no HIDDEN flag. */
    if (s_lcd_spectrum_paused ||
        !lv_obj_is_visible(s_lcd_spectrum_obj) ||
        (lv_obj_get_screen(s_lcd_spectrum_obj) != lv_screen_active())) {
        lcd_native_capture_apply(false);
        return;
    }

    /* The inactive-screen branch above disables capture without changing the
     * selected views or the RX/TX source identity. Reconcile gates on every
     * visible tick, not just on a source change: HOME can return without a
     * Python pause setter, and fresh IQADC construction clears these gates too.
     * Enabled producers are idempotent; their partial frames are not reset. */
    lcd_native_capture_apply(true);

    #if defined(RA6M3) && MICROPY_HW_ENABLE_TX
    ra_tx_status_t tx_status;
    ra_tx_hw_get_status(&tx_status);
    uint32_t source = !tx_status.owned ? 0U :
        ((tx_status.running && !tx_status.error && !tx_status.af_error &&
          tx_status.mode != RA_TX_MODE_CW) ? 1U : 2U);
    uint32_t epoch = source ? ra_tx_hw_adc_epoch() : 0U;
    if (source != s_lcd_scope_source || epoch != s_lcd_scope_tx_epoch) {
        s_lcd_scope_source = source;
        s_lcd_scope_tx_epoch = epoch;
        s_lcd_right_clear_pending = 1U;
        s_lcd_left_clear_pending = 1U;
        s_lcd_spectrum_valid = 0U;
        s_lcd_scope_last_ms = 0U;
    }
    #endif
    lcd_native_clear_pending();
    #if defined(RA6M3) && MICROPY_HW_ENABLE_TX
    if (source) {
        uint32_t tx_now = (uint32_t)mp_hal_ticks_ms();
        if (source == 1U && s_lcd_scope_view != LCD_SCOPE_VIEW_OFF &&
            (uint32_t)(tx_now - s_lcd_scope_last_ms) >= LCD_SCOPE_FRAME_MS) {
            const int16_t *samples;
            size_t n;
            uint32_t rate_hz;
            if (ra_tx_hw_scope_frame(&samples, &n, &rate_hz)) {
                s_lcd_scope_last_ms = tx_now;
                lcd_scope_write_rate(samples, n, rate_hz);
            }
        }
        return; /* No RX DAC/FFT/IQ frames can represent TX microphone audio. */
    }
    #endif
    if ((s_lcd_spectrum_view == LCD_VIEW_OFF) &&
        (s_lcd_scope_view == LCD_SCOPE_VIEW_OFF) &&
        !s_lcd_spectrum_vfo_pending) {
        return;
    }

    uint32_t now = (uint32_t)mp_hal_ticks_ms();
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    if ((s_lcd_spectrum_view == LCD_VIEW_OFF) &&
        s_lcd_spectrum_vfo_pending) {
        lcd_spectrum_complete_hidden_generation(now);
        if (s_lcd_scope_view == LCD_SCOPE_VIEW_OFF) {
            return;
        }
    }
    if (s_lcd_spectrum_view == LCD_VIEW_WATERFALL) {
        if ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >= LCD_WATERFALL_FRAME_MS) {
            /* Advance the deadline, not "last = now".  The measured panel is 50 Hz;
             * retaining the 33 ms phase yields a 20/40/40 ms VSYNC pattern and a
             * true 30 rows/s average instead of rounding every update down to 25 Hz. */
            if ((s_lcd_spectrum_last_fft_ms == 0U) ||
                ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
                 (3U * LCD_WATERFALL_FRAME_MS))) {
                s_lcd_spectrum_last_fft_ms = now;
            } else {
                s_lcd_spectrum_last_fft_ms += LCD_WATERFALL_FRAME_MS;
            }
            const float *magnitudes;
            float ref_peak;
            int32_t marker_bins;
            uint32_t generation;
            const int16_t *scope_samples = NULL;
            size_t scope_n = 0U;
            const int16_t *i_samples = NULL;
            const int16_t *q_samples = NULL;
            size_t iq_n = 0U;
            bool scope_ready = false;
            bool iq_ready = false;
            if (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) {
                scope_ready = ra_iq_adc_scope_frame(&scope_samples, &scope_n);
            } else if (s_lcd_scope_view == LCD_SCOPE_VIEW_IQ) {
                iq_ready = ra_iq_adc_constellation_frame(&i_samples, &q_samples,
                    &iq_n);
            }
            uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
            bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &marker_bins,
                &generation, NULL, NULL, NULL);
            uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
            bool commit_generation = false;
            if (ready && !lcd_spectrum_generation_prepare(generation,
                &commit_generation)) {
                ready = false;
            }
            if (ready) {
                s_lcd_fft_last_us = fft_elapsed;
                if (fft_elapsed > s_lcd_fft_max_us) {
                    s_lcd_fft_max_us = fft_elapsed;
                }
                if (commit_generation) {
                    (void)lcd_spectrum_stage_generation(magnitudes, ref_peak,
                        marker_bins, generation);
                    /* A staged left frame remains invisible until Python has
                     * synchronously replaced the frequency labels. */
                    if (scope_ready) {
                        lcd_scope_write(scope_samples, scope_n);
                    } else if (iq_ready) {
                        lcd_constellation_write(i_samples, q_samples, iq_n);
                    }
                } else {
                    int32_t previous_marker_px = s_lcd_spectrum_marker_px;
                    s_lcd_spectrum_marker_px = lcd_spectrum_marker_from_bins(
                        marker_bins, (uint32_t)ra_iq_adc_spectrum_size());
                    if (!lcd_waterfall_write(magnitudes, ref_peak,
                        scope_ready ? scope_samples : NULL, scope_n,
                        iq_ready ? i_samples : NULL,
                        iq_ready ? q_samples : NULL, iq_n)) {
                        s_lcd_spectrum_marker_px = previous_marker_px;
                    }
                }
            } else if (scope_ready) {
                lcd_scope_write(scope_samples, scope_n);
            } else if (iq_ready) {
                lcd_constellation_write(i_samples, q_samples, iq_n);
            }
        }
        return;
    }

    if ((s_lcd_scope_view != LCD_SCOPE_VIEW_OFF) &&
        ((uint32_t)(now - s_lcd_scope_last_ms) >= LCD_SCOPE_FRAME_MS)) {
        if ((s_lcd_scope_last_ms == 0U) ||
            ((uint32_t)(now - s_lcd_scope_last_ms) >
                 (3U * LCD_SCOPE_FRAME_MS))) {
            s_lcd_scope_last_ms = now;
        } else {
            s_lcd_scope_last_ms += LCD_SCOPE_FRAME_MS;
        }
        if (s_lcd_scope_view == LCD_SCOPE_VIEW_IQ) {
            const int16_t *i_samples;
            const int16_t *q_samples;
            size_t iq_n;
            if (ra_iq_adc_constellation_frame(&i_samples, &q_samples, &iq_n)) {
                lcd_constellation_write(i_samples, q_samples, iq_n);
            }
        } else if (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) {
            const int16_t *samples;
            size_t sample_count;
            if (ra_iq_adc_scope_frame(&samples, &sample_count)) {
                lcd_scope_write(samples, sample_count);
            }
        }
    }

    if ((s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) &&
        ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >= LCD_SPECTRUM_FRAME_MS)) {
        if ((s_lcd_spectrum_last_fft_ms == 0U) ||
            ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
             (3U * LCD_SPECTRUM_FRAME_MS))) {
            s_lcd_spectrum_last_fft_ms = now;
        } else {
            s_lcd_spectrum_last_fft_ms += LCD_SPECTRUM_FRAME_MS;
        }
        const float *magnitudes;
        float ref_peak;
        int32_t marker_bins;
        uint32_t generation;
        uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
        bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &marker_bins,
            &generation, NULL, NULL, NULL);
        uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
        bool commit_generation = false;
        if (ready && !lcd_spectrum_generation_prepare(generation,
            &commit_generation)) {
            ready = false;
        }
        if (ready) {
            s_lcd_fft_last_us = fft_elapsed;
            if (fft_elapsed > s_lcd_fft_max_us) {
                s_lcd_fft_max_us = fft_elapsed;
            }
            uint32_t fft_n = (uint32_t)ra_iq_adc_spectrum_size();
            if (commit_generation) {
                (void)lcd_spectrum_stage_generation(magnitudes, ref_peak,
                    marker_bins, generation);
            } else {
                int32_t previous_marker_px = s_lcd_spectrum_marker_px;
                s_lcd_spectrum_marker_px = lcd_spectrum_marker_from_bins(marker_bins,
                    fft_n);
                if (!(lcd_spectrum_state_from_frame(magnitudes, fft_n, ref_peak) &&
                    lcd_spectrum_write())) {
                    s_lcd_spectrum_marker_px = previous_marker_px;
                }
            }
        }
    }
    #endif
}

static void lcd_lv_spectrum_event_cb(lv_event_t *e) {
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = lv_event_get_target_obj(e);
    if (code == LV_EVENT_DELETE) {
        if (obj == s_lcd_spectrum_obj) {
            s_lcd_spectrum_obj = NULL;
            s_lcd_spectrum_valid = 0U;
            lcd_spectrum_tuning_reset();
            s_lcd_left_clear_pending = 0U;
            s_lcd_right_clear_pending = 0U;
            lcd_native_capture_apply(false);
            if (s_lcd_spectrum_timer != NULL) {
                lv_timer_delete(s_lcd_spectrum_timer);
                s_lcd_spectrum_timer = NULL;
            }
        }
        return;
    }
    if ((code != LV_EVENT_DRAW_MAIN) || (obj != s_lcd_spectrum_obj)) {
        return;
    }
    if (ra_tx_hw_owns_resources()) {
        return; /* Do not repaint the last RX spectrum while transmitting. */
    }

    if ((s_lcd_spectrum_view == LCD_VIEW_WATERFALL) ||
        (s_lcd_spectrum_view == LCD_VIEW_OFF)) {
        /* The framebuffer itself is the waterfall history. Routine LVGL redraws
         * can reach this transparent object, so never clear the full native area
         * here. True ownership changes request an explicit reset elsewhere. */
        return;
    }

    lv_layer_t *layer = lv_event_get_layer(e);
    lv_area_t obj_area;
    lv_area_t plot_area;
    lv_obj_get_coords(obj, &obj_area);
    lcd_lv_spectrum_plot_area(&obj_area, &plot_area);

    lv_draw_rect_dsc_t rect;
    lv_draw_rect_dsc_init(&rect);
    rect.bg_opa = LV_OPA_COVER;
    rect.border_opa = LV_OPA_TRANSP;
    rect.radius = 0;

