tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    /* This callback owns only the left plot.  The right TIME/I-Q panel is a
     * separate native framebuffer surface and survives foreign/full redraws. */
    rect.bg_color = s_lcd_spectrum_bg;
    lv_draw_rect(layer, &rect, &plot_area);

    int32_t plot_h = lv_area_get_height(&plot_area);
    int32_t cursor_x = lcd_tune_cursor_x(&plot_area);
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        int32_t height = s_lcd_spectrum_h[x];
        if (height <= 0) {
            continue;
        }
        if (height > plot_h) {
            height = plot_h;
        }
        lv_area_t column = {
            .x1 = plot_area.x1 + (int32_t)x,
            .x2 = plot_area.x1 + (int32_t)x,
            .y1 = plot_area.y2 - height + 1,
            .y2 = plot_area.y2,
        };
        if ((column.x2 < layer->_clip_area.x1) ||
            (column.x1 > layer->_clip_area.x2) ||
            (column.y2 < layer->_clip_area.y1) ||
            (column.y1 > layer->_clip_area.y2)) {
            continue;
        }
        rect.bg_color = (column.x1 == cursor_x) ? s_lcd_spectrum_center :
            s_lcd_spectrum_bar;
        lv_draw_rect(layer, &rect, &column);
    }

    int32_t cursor_top = plot_area.y1;
    lv_area_t cursor_stem = {
        .x1 = cursor_x - 1,
        .x2 = cursor_x + 1,
        .y1 = cursor_top + 2,
        .y2 = plot_area.y2,
    };
    rect.bg_color = lv_color_make(0U, 0U, 0U);
    lv_draw_rect(layer, &rect, &cursor_stem);
    cursor_stem.x1 = cursor_x;
    cursor_stem.x2 = cursor_x;
    rect.bg_color = s_lcd_spectrum_center;
    lv_draw_rect(layer, &rect, &cursor_stem);

    lv_area_t cursor_head = {
        .x1 = cursor_x - (int32_t)(LCD_TUNE_CURSOR_PX / 2U),
        .x2 = cursor_x + (int32_t)(LCD_TUNE_CURSOR_PX / 2U),
        .y1 = cursor_top,
        .y2 = cursor_top,
    };
    rect.bg_color = lv_color_make(0U, 0U, 0U);
    lv_draw_rect(layer, &rect, &cursor_head);
    cursor_head.x1++;
    cursor_head.x2--;
    cursor_head.y1++;
    cursor_head.y2++;
    rect.bg_color = lv_color_make(255U, 255U, 255U);
    lv_draw_rect(layer, &rect, &cursor_head);
    s_lcd_spectrum_valid = 1U;
}

static lv_obj_t *lcd_lv_obj_from_mp(mp_obj_t obj_in) {
    mp_buffer_info_t bi;
    mp_get_buffer_raise(obj_in, &bi, MP_BUFFER_READ);
    if (bi.len != sizeof(lv_obj_t *)) {
        mp_raise_ValueError(MP_ERROR_TEXT("expected LVGL object"));
    }
    lv_obj_t *obj = NULL;
    memcpy(&obj, bi.buf, sizeof(obj));
    if ((obj == NULL) || !lv_obj_is_valid(obj)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid LVGL object"));
    }
    return obj;
}

// spectrum_attach(obj[, bg_rgb, bar_rgb, center_rgb]) -> bool
// Attach the single native spectrum surface and delete the legacy bar children.
STATIC mp_obj_t lcd_spectrum_attach(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (!lv_is_initialized()) {
        return mp_const_false;
    }
    lv_obj_t *obj = lcd_lv_obj_from_mp(args[1]);
    uint32_t bg = (n_args > 2U) ? (uint32_t)mp_obj_get_int(args[2]) : 0xFFFFFFU;
    uint32_t bar = (n_args > 3U) ? (uint32_t)mp_obj_get_int(args[3]) : 0xB6BDC6U;
    uint32_t center = (n_args > 4U) ? (uint32_t)mp_obj_get_int(args[4]) : 0x0097A7U;

    s_lcd_spectrum_bg = lv_color_hex(bg & 0xFFFFFFU);
    s_lcd_spectrum_bar = lv_color_hex(bar & 0xFFFFFFU);
    s_lcd_spectrum_center = lv_color_hex(center & 0xFFFFFFU);

    if (s_lcd_spectrum_obj != obj) {
        lv_timer_t *new_timer = lv_timer_create(lcd_lv_spectrum_timer_cb,
            LCD_SPECTRUM_TICK_MS, NULL);
        if (new_timer == NULL) {
            return mp_const_false;
        }
        if ((s_lcd_spectrum_obj != NULL) && lv_obj_is_valid(s_lcd_spectrum_obj)) {
            (void)lv_obj_remove_event_cb(s_lcd_spectrum_obj, lcd_lv_spectrum_event_cb);
        }
        lv_obj_clean(obj);
        memset(s_lcd_spectrum_h, 0, sizeof(s_lcd_spectrum_h));
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_view = LCD_VIEW_SPECTRUM;
        s_lcd_spectrum_paused = 0U;
        s_lcd_spectrum_pause_rebuild = 0U;
        s_lcd_waterfall_reset = 1U;
        lcd_spectrum_tuning_reset();
        s_lcd_left_clear_pending = 0U;
        s_lcd_spectrum_last_fft_ms = (uint32_t)mp_hal_ticks_ms();
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        s_lcd_const_peak = 32;
        s_lcd_scope_view = LCD_SCOPE_VIEW_TIME;
        s_lcd_right_clear_pending = 0U;
        s_lcd_scope_last_ms = s_lcd_spectrum_last_fft_ms;
        s_lcd_spectrum_obj = obj;
        lv_obj_add_event_cb(obj, lcd_lv_spectrum_event_cb, LV_EVENT_DRAW_MAIN, NULL);
        lv_obj_add_event_cb(obj, lcd_lv_spectrum_event_cb, LV_EVENT_DELETE, NULL);
        if (s_lcd_spectrum_timer != NULL) {
            lv_timer_delete(s_lcd_spectrum_timer);
        }
        s_lcd_spectrum_timer = new_timer;
    }
    lcd_native_capture_apply(true);
    lv_obj_invalidate(obj);
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_attach_obj, 2, 5,
    lcd_spectrum_attach);

// spectrum_update(array('h', 27)) -> number of changed input heights, or False if detached.
// Preserve the Python/demo API by expanding 27 input heights across the persistent
// 256-column SPEC state.  Live SPEC frames bypass this compatibility path and use
// the raw 512-bin physical-LO magnitude/ref_peak panorama mapping.
STATIC mp_obj_t lcd_spectrum_update(mp_obj_t self_in, mp_obj_t buf_in) {
    (void)self_in;
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        s_lcd_spectrum_obj = NULL;
        s_lcd_spectrum_valid = 0U;
        lcd_native_capture_apply(false);
        return mp_const_false;
    }
    if (s_lcd_spectrum_view != LCD_VIEW_SPECTRUM) {
        return MP_OBJ_NEW_SMALL_INT(0);
    }

    mp_buffer_info_t bi;
    mp_get_buffer_raise(buf_in, &bi, MP_BUFFER_READ);
    if ((bi.typecode != 'h') ||
        (bi.len < LCD_SPECTRUM_INPUT_BARS * sizeof(int16_t))) {
        mp_raise_ValueError(MP_ERROR_TEXT("buf must be array('h', >=27)"));
    }
    const int16_t *src = (const int16_t *)bi.buf;

    uint8_t input_changed[LCD_SPECTRUM_INPUT_BARS] = { 0 };
    uint32_t changed_columns = 0U;
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        uint32_t input = (x * LCD_SPECTRUM_INPUT_BARS) / LCD_SPECTRUM_COLUMNS;
        int16_t h = src[input];
        if (h < 2) {
            h = 2;
        } else if (h > LCD_SPECTRUM_MAX_H_PX) {
            h = LCD_SPECTRUM_MAX_H_PX;
        }
        if (!s_lcd_spectrum_valid || (h != s_lcd_spectrum_h[x])) {
            s_lcd_spectrum_h[x] = h;
            input_changed[input] = 1U;
            changed_columns++;
        }
    }
    uint32_t changed_inputs = 0U;
    for (uint32_t input = 0U; input < LCD_SPECTRUM_INPUT_BARS; ++input) {
        changed_inputs += input_changed[input];
    }
    s_lcd_spectrum_valid = 1U;
    if ((changed_columns != 0U) && !s_lcd_spectrum_paused &&
        (lv_obj_get_screen(s_lcd_spectrum_obj) == lv_screen_active())) {
        lcd_spectrum_write();
    }
    return MP_OBJ_NEW_SMALL_INT((mp_int_t)changed_inputs);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_spectrum_update_obj, lcd_spectrum_update);

// spectrum_center(vfo_hz) -> positive generation token.
// spectrum_center() -> 0 before a request, -token while collecting, +token when
// one complete matching FFT is staged and stable.  Python must paint the matching
// labels and call spectrum_publish(token); NCO-only changes never call this API.
STATIC mp_obj_t lcd_spectrum_center(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        if (s_lcd_spectrum_vfo_pending) {
            if (s_lcd_spectrum_generation_ready ==
                s_lcd_spectrum_generation_pending) {
                return mp_obj_new_int_from_uint(
                    s_lcd_spectrum_generation_ready);
            }
            return mp_obj_new_int_from_ll(
                -((int64_t)s_lcd_spectrum_generation_pending));
        }
        if (s_lcd_spectrum_vfo_valid) {
            return mp_obj_new_int_from_uint(
                s_lcd_spectrum_generation_committed);
        }
        return MP_OBJ_NEW_SMALL_INT(0);
    }

    mp_int_t vfo_hz_arg = mp_obj_get_int(args[1]);
    if ((vfo_hz_arg <= 0) || ((uint64_t)vfo_hz_arg > (uint64_t)INT32_MAX)) {
        mp_raise_ValueError(MP_ERROR_TEXT("vfo_hz must fit positive int32"));
    }
    int32_t vfo_hz = (int32_t)vfo_hz_arg;
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    uint32_t generation = ra_iq_adc_spectrum_rebase();
    s_lcd_spectrum_vfo_pending_hz = vfo_hz;
    s_lcd_spectrum_generation_pending = generation;
    s_lcd_spectrum_generation_ready = 0U;
    s_lcd_spectrum_generation_armed = 0U;
    s_lcd_spectrum_vfo_pending = 1U;
    /* A modal may have paused display writes.  Keep the spectrum producer alive
     * while the barrier is pending so resume can claim a matching complete FFT. */
    lcd_native_capture_apply(true);
    return mp_obj_new_int_from_uint(generation);
    #else
    return mp_const_false;
    #endif
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_center_obj, 1, 2,
    lcd_spectrum_center);

// spectrum_publish() -> last committed generation.
// spectrum_publish(generation) -> arm one staged physical-LO frame; Python then
// updates its matching RF labels and forces the publishing render.
// spectrum_publish(-generation) -> abort that armed frame without dropping staging.
STATIC mp_obj_t lcd_spectrum_publish(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    if (n_args == 1U) {
        return mp_obj_new_int_from_uint(s_lcd_spectrum_generation_committed);
    }
    mp_int_t generation_arg = mp_obj_get_int(args[1]);
    if (generation_arg == 0) {
        return mp_const_false;
    }
    if (generation_arg < 0) {
        int64_t magnitude = -(int64_t)generation_arg;
        if ((uint64_t)magnitude > UINT32_MAX) {
            return mp_const_false;
        }
        return mp_obj_new_bool(lcd_spectrum_abort_generation(
            (uint32_t)magnitude));
    }
    if ((uint64_t)generation_arg > UINT32_MAX) {
        return mp_const_false;
    }
    return mp_obj_new_bool(lcd_spectrum_publish_generation(
        (uint32_t)generation_arg));
    #else
    (void)n_args;
    return mp_const_false;
    #endif
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_publish_obj, 1, 2,
    lcd_spectrum_publish);

// spectrum([view]) -- left native panel: 0 = bars, 1 = waterfall, 2 = OFF.
// With no argument return:
// (view, direct_rows, last_write_us, max_write_us, last_fft_us, max_fft_us).
STATIC mp_obj_t lcd_spectrum(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        mp_obj_t t[6] = {
            MP_OBJ_NEW_SMALL_INT(s_lcd_spectrum_view),
            mp_obj_new_int_from_uint(s_lcd_waterfall_rows),
            mp_obj_new_int_from_uint(s_lcd_waterfall_last_us),
            mp_obj_new_int_from_uint(s_lcd_waterfall_max_us),
            mp_obj_new_int_from_uint(s_lcd_fft_last_us),
            mp_obj_new_int_from_uint(s_lcd_fft_max_us),
        };
        return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    }

