tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_VIEW_SPECTRUM) &&
        (view != (mp_int_t)LCD_VIEW_WATERFALL) &&
        (view != (mp_int_t)LCD_VIEW_OFF)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0, 1, or 2"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_spectrum_view) {
        s_lcd_spectrum_view = (uint8_t)view;
        s_lcd_left_clear_pending =
            (view == (mp_int_t)LCD_VIEW_OFF) ? 1U : 0U;
        s_lcd_spectrum_valid = 0U;
        s_lcd_waterfall_reset = 1U;
        s_lcd_spectrum_last_fft_ms = 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_const_peak = 32;
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        lcd_native_capture_apply(true);
        lv_obj_invalidate(s_lcd_spectrum_obj);
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_obj, 1, 2,
    lcd_spectrum);

// scope_view([view]) -- right native panel: 0 = played DAC time trace,
// 1 = I/Q constellation from the independent final-complex snapshot, 2 = OFF.
STATIC mp_obj_t lcd_scope_view(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return MP_OBJ_NEW_SMALL_INT(s_lcd_scope_view);
    }
    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_SCOPE_VIEW_TIME) &&
        (view != (mp_int_t)LCD_SCOPE_VIEW_IQ) &&
        (view != (mp_int_t)LCD_SCOPE_VIEW_OFF)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0, 1, or 2"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_scope_view) {
        s_lcd_scope_view = (uint8_t)view;
        s_lcd_right_clear_pending =
            (view == (mp_int_t)LCD_SCOPE_VIEW_OFF) ? 1U : 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_const_peak = 32;
        lcd_native_capture_apply(true);
        /* Do not invalidate the whole transparent native object here: in WF mode
         * its framebuffer pixels are retained history.  The timer either performs
         * the pending OFF clear or rebuilds only the right panel from a fresh frame. */
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_scope_view_obj, 1, 2,
    lcd_scope_view);

// spectrum_pause([pause[, rebuild]]) -- stop direct framebuffer writes.  Modal
// overlays pass rebuild=true because they overwrite the native pixels; a short
// Si5351 transaction passes false and therefore preserves the old SPEC/WF image.
STATIC mp_obj_t lcd_spectrum_pause(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return mp_obj_new_bool(s_lcd_spectrum_paused != 0U);
    }

    uint8_t paused = mp_obj_is_true(args[1]) ? 1U : 0U;
    uint8_t rebuild = (n_args > 2U) ?
        (mp_obj_is_true(args[2]) ? 1U : 0U) : 1U;
    if (paused && rebuild) {
        /* Remember an overlapping modal even when a transition already owns the
         * pause.  The dirty request is consumed only by the eventual union resume. */
        s_lcd_spectrum_pause_rebuild = 1U;
    }
    if (paused != s_lcd_spectrum_paused) {
        s_lcd_spectrum_paused = paused;
        if (!paused && s_lcd_spectrum_pause_rebuild &&
            (s_lcd_spectrum_obj != NULL) &&
            lv_obj_is_valid(s_lcd_spectrum_obj)) {
            /* The overlay/full-screen redraw owns these framebuffer pixels while
             * paused.  Rebuild the whole native surface on the first HOME frame. */
            s_lcd_waterfall_reset = 1U;
            s_lcd_spectrum_last_fft_ms = 0U;
            s_lcd_scope_last_ms = 0U;
            lv_obj_invalidate(s_lcd_spectrum_obj);
            s_lcd_spectrum_pause_rebuild = 0U;
        }
    }
    /* IQADC init/deinit deliberately clears every optional display producer.
     * Re-apply the selected capture matrix even when the pause value itself is
     * unchanged, so an idempotent resume after RX start repairs that lifecycle
     * boundary without cycling TIME/I-Q/OFF or destroying waterfall history. */
    lcd_native_capture_apply(true);
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_pause_obj, 1, 3,
    lcd_spectrum_pause);

// scroll_rect(x, y, w, h, dy) -> bool
// Stage one overlap-safe RGB565 move for the next LVGL render-start transaction.
// Positive dy moves the existing pixels down; negative dy moves them up.
STATIC mp_obj_t lcd_scroll_rect(size_t n_args, const mp_obj_t *args) {
    (void)n_args;
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    int32_t x = (int32_t)mp_obj_get_int(args[1]);
    int32_t y = (int32_t)mp_obj_get_int(args[2]);
    int32_t w = (int32_t)mp_obj_get_int(args[3]);
    int32_t h = (int32_t)mp_obj_get_int(args[4]);
    int32_t dy = (int32_t)mp_obj_get_int(args[5]);
    uint32_t screen_w = g_display0_cfg.input[0].hsize;
    uint32_t screen_h = g_display0_cfg.input[0].vsize;

    if (!self->isinited || !self->isstarted || !s_lcd_lvgl_bridged ||
        !lv_is_initialized() || (s_lcd_lvgl_display == NULL) ||
        (lv_display_get_default() != s_lcd_lvgl_display) ||
        (g_display0_cfg.input[0].format != DISPLAY_IN_FORMAT_16BITS_RGB565) ||
        (g_display0_cfg.input[0].p_base == NULL) ||
        (g_display0_cfg.input[0].hstride < screen_w) ||
        (s_lcd_scroll_blit.pending != 0U) ||
        (x < 0) || (y < 0) || (w <= 0) || (h <= 0) || (dy == 0) ||
        (dy <= -h) || (dy >= h) ||
        ((uint32_t)w > screen_w) || ((uint32_t)h > screen_h) ||
        ((uint32_t)x > screen_w - (uint32_t)w) ||
        ((uint32_t)y > screen_h - (uint32_t)h)) {
        return mp_const_false;
    }

    s_lcd_scroll_blit.x = x;
    s_lcd_scroll_blit.y = y;
    s_lcd_scroll_blit.w = w;
    s_lcd_scroll_blit.h = h;
    s_lcd_scroll_blit.dy = dy;
    __DMB();
    s_lcd_scroll_blit.pending = 1U;
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_scroll_rect_obj, 6, 6,
    lcd_scroll_rect);

